Revit 2027 API
ParameterAccess.ListParameters(LinkElementId) Method
 Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<Document, IList<ElementId>> ListParameters(
	LinkElementId id
)
Public Function ListParameters (
	id As LinkElementId
) As IDictionary(Of Document, IList(Of ElementId))
public:
IDictionary<Document^, IList<ElementId^>^>^ ListParameters(
	LinkElementId^ id
)
member ListParameters :
        id : LinkElementId -> IDictionary<Document, IList<ElementId>>
Parameters
id LinkElementId
LinkElementId of the element whose parameters should be listed.
Return Value
IDictionary<Document, IList<ElementId>>
 The ids of parameters applicable to the element, collected by the Document where the Definition of those parameters are stored.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterAccess Class
ListParameters Overload
Autodesk.Revit.DB Namespace